Configuration_project_01/src/DataProcessors/АЭС_ЗагрузкаОбновлениеНомеровУслугИзСТЕК/АЭС_ЗагрузкаОбновлениеНомеровУслугИзСТЕК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АЭС_ЗагрузкаОбновлениеНомеровУслугИзСТЕК</name>
  <attributes>
    <name>ПрефиксНомераЛС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйНомерЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйНомерЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>УслугаСТЕК</name>
      <type>
        <types>CatalogRef.АЭС_УслугиСТЕК</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерУслуги</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеУслугиКраткое</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеУслугиПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Configuration_project_01/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдДоговораЮЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Configuration_project_01/src/DataProcessors/АЭС_ЗагрузкаОбновлениеНомеровУслугИзСТЕК/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьНачальныйКонечныйНомерЛСНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(Контрагенты.НомерЛС) КАК МинНомерЛС,
	|	МАКСИМУМ(Контрагенты.НомерЛС) КАК МаксНомерЛС
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.НомерЛС ПОДОБНО &НомерЛС";
	
	
	Запрос.УстановитьПараметр("НомерЛС", Строка(Объект.ПрефиксНомераЛС) + "%");
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выб = Рез.Выбрать();
	Выб.Следующий();
	Сообщить(Выб.МинНомерЛС);
	Сообщить(Выб.МаксНомерЛС);
	
	Объект.НачальныйНомерЛС	= Выб.МинНомерЛС;
	Объект.КонечныйНомерЛС	= Выб.МаксНомерЛС;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачальныйКонечныйНомерЛС(Команда)
	ЗаполнитьНачальныйКонечныйНомерЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомераУслугПоНачислениямЗаПериодНаСервере()
	
	Соотв = Новый Соответствие;
	
	Сообщить(ТекущаяДата());
	
	НачЛС = Число(Объект.НачальныйНомерЛС);
	КонЛС = Число(Объект.КонечныйНомерЛС);
	лСоединение = Неопределено;// иниц-я
	ТаблицаСвертки = Неопределено;
	Для й = НачЛС По КонЛС Цикл
		//ОбработкаПрерыванияПользователя();
		НомерЛС = Формат(й, "ЧГ=0");
		СтруктураСтатуса = АЭС_Стек.ПолучитьСтатусЛицевогоСчета(НомерЛС, Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо, лСоединение);
			
		Если СтруктураСтатуса <> Неопределено И СтруктураСтатуса.СуществуетЛС 
			//И СтруктураСтатуса.СтатусЛС > 0 
			Тогда
			ТЗ = АЭС_Стек.ПолучитьТаблицуЗадолженности(НомерЛС, Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо, Объект.Период); 
			Если ТЗ <> Неопределено И ТЗ.Количество() > 0 Тогда
				Если Ложь Тогда ТЗ = Новый ТаблицаЗначений КонецЕсли;
				Если ТаблицаСвертки = Неопределено Тогда
					ТаблицаСвертки = ТЗ.СкопироватьКолонки();
				КонецЕсли;
				
				Для Каждого стрТЗ Из ТЗ Цикл
					//Сообщить(Строка(стрТЗ.НомерУслуги) + "	" + стрТЗ.НаименованиеУслугиКраткое);
					//Соотв.Вставить(стрТЗ.НомерУслуги, стрТЗ.НаименованиеУслугиКраткое); 
					
					НовСтр = ТаблицаСвертки.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, стрТЗ);
					
					
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаСвертки.Свернуть("НомерУслуги, НаименованиеУслугиКраткое, НаименованиеУслугиПолное");
	
	ТаблицаПроверки = ТаблицаСвертки.Скопировать();
	
	ТаблицаПроверки.Свернуть("НомерУслуги");
	
	Если ТаблицаСвертки.Количество() <> ТаблицаПроверки.Количество() Тогда
		//Сообщить();
		ВызватьИсключение "Одинаковые номера услуг!";
	КонецЕсли;
	
	ТЧ = Объект.ТабличнаяЧасть;
	
	Для Каждого стрТЗ Из ТаблицаСвертки Цикл
		НовСтр = ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, стрТЗ);
		УслугаСТЕК = АЭС_Сервер.ПолучитьУслугуСТЕКПоНомеру(стрТЗ.НомерУслуги, Объект.Организация, стрТЗ.НаименованиеУслугиКраткое, стрТЗ.НаименованиеУслугиПолное);
		
		НовСтр.УслугаСТЕК = УслугаСТЕК;
		
		НовСтр.Номенклатура = УслугаСТЕК.Номенклатура;
	КонецЦикла;
	
	Сообщить(ТекущаяДата());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНомераУслугПоНачислениямЗаПериод(Команда)
	ЗаполнитьНомераУслугПоНачислениямЗаПериодНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНоменклатурВУслугуЕслиНеСовпадаетНаСервере()
	
	Для Каждого стрТЧ Из Объект.ТабличнаяЧасть Цикл
		Если стрТЧ.Номенклатура = стрТЧ.УслугаСТЕК.Номенклатура И ЗначениеЗаполнено(стрТЧ.Номенклатура) Тогда
			
			УслугаОб = стрТЧ.УслугаСТЕК.ПолучитьОбъект();
			УслугаОб.Номенклатура = стрТЧ.Номенклатура;
			УслугаОб.Записать();
		КонецЕсли;
	КонецЦикла;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНоменклатурВУслугуЕслиНеСовпадает(Команда)
	ЗаписатьНоменклатурВУслугуЕслиНеСовпадаетНаСервере();
КонецПроцедуры
